//////////////////////////////////////////////////////////
// KSDC Proprietary
// Course: 반도체설계검증 언어기초
// File  : class05_ex05_enum_encoding_problem_blank.sv
// Date  : 2026-02-28
// Author: Jongsup Baek <jongsup.baek@ksdcsemi.com>
//////////////////////////////////////////////////////////

module tb;

   // Comment #1 :
   // 0 :
   // 1 : idle
   // 2 : start
   // 3 :
   // 4 : pause
   // 5 : 
   // ...
   // 8 : done
   // ...
   typedef enum { idle  =1, 
                  start =2, 
                  pause =4, 
                  done  =8} state_t ;

   // Comment #2 :
   // 0 : S0 
   // 1 : S1 
   // ...
   // 6 : S2
   // 7 : S3
   // ...
   enum {S0=0, S1, S2=6, S3} encs ;

//////////////////////////////////////////////////////////
// 여기에 적으세요. (시작)
// HINT: 이 블록의 에러를 찾아 수정하세요
//////////////////////////////////////////////////////////
   // Comment #3 : ERROR
   // 0 : P0
   // 1 : P1, P2 [Overlap]
   // 2 : P3
   enum {P0=0, P1, P2=1, P3} bad_encs ;
//////////////////////////////////////////////////////////
// 여기까지 입니다. (끝)
//////////////////////////////////////////////////////////
endmodule
